{
  "activation": "gelu",
  "architectures": ["DistilBertForSequenceClassification"],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "finetuning_task": "text-classification",
  "hidden_dim": 3072,
  "id2label": {
    "0": "negative",
    "1": "neutral",
    "2": "positive"
  },
  "label2id": {
    "negative": 0,
    "neutral": 1,
    "positive": 2
  },
  "initializer_range": 0.02,
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "num_labels": 3,
  "output_past": true,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.35.0",
  "vocab_size": 30522,
  "_name_or_path": "distilbert-base-uncased",
  "problem_type": "single_label_classification",
  "task_specific_params": {
    "sentiment_classification": {
      "num_labels": 3,
      "classes": ["negative", "neutral", "positive"],
      "max_seq_length": 128,
      "test_accuracy": 0.876,
      "test_f1_macro": 0.871
    }
  }
}
